MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX350F128H.PIC
      <edc:SFRDef edc:_addr="0x1F886680" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="6" edc:access="----------------------nnnn--nn--" edc:cname="CNENG" edc:desc="" edc:grp="PORTG" edc:impl="0xffc003cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000------------xxxx--xx--" edc:name="CNENG" edc:nzwidth="0x20" edc:por="0000000000------------xxxx--xx--" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEG2" edc:desc="" edc:mask="0x1" edc:name="CNIEG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG3" edc:desc="" edc:mask="0x1" edc:name="CNIEG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEG6" edc:desc="" edc:mask="0x1" edc:name="CNIEG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG7" edc:desc="" edc:mask="0x1" edc:name="CNIEG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG8" edc:desc="" edc:mask="0x1" edc:name="CNIEG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG9" edc:desc="" edc:mask="0x1" edc:name="CNIEG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886690" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-01618_TRAE_Ports.Module" edc:_refcount="6" edc:access="----------------------nnnn--nn--" edc:cname="CNSTATG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff03cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxx--xx--" edc:name="CNSTATG" edc:nzwidth="0x20" edc:por="----------------------xxxx--xx--" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG2" edc:desc="" edc:mask="0x1" edc:name="CNSTATG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG3" edc:desc="" edc:mask="0x1" edc:name="CNSTATG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG6" edc:desc="" edc:mask="0x1" edc:name="CNSTATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG7" edc:desc="" edc:mask="0x1" edc:name="CNSTATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG8" edc:desc="" edc:mask="0x1" edc:name="CNSTATG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG9" edc:desc="" edc:mask="0x1" edc:name="CNSTATG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x8000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:kuseg="0x7f000000" edc:regionid="kseg1_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f80a400" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph2">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-01385_wdt_pwrt_pb_v2.Module" edc:_refcount="1" edc:access="----------------n--------rrrrrnn" edc:cname="WDTCON" edc:desc="" edc:grp="WDT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--------xxxxxxx" edc:name="WDTCON" edc:nzwidth="0x20" edc:por="----------------0--------00000x0" edc:portals="CLR SET INV" ltx:baseofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDTCLR" edc:desc="" edc:mask="0x1" edc:name="WDTCLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:desc="" edc:mask="0x1" edc:name="WDTWINEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS" edc:desc="" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SWDTPS0" edc:desc="" edc:mask="0x1" edc:name="SWDTPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS1" edc:desc="" edc:mask="0x1" edc:name="SWDTPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS2" edc:desc="" edc:mask="0x1" edc:name="SWDTPS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS3" edc:desc="" edc:mask="0x1" edc:name="SWDTPS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS4" edc:desc="" edc:mask="0x1" edc:name="SWDTPS4" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPSTA" edc:desc="" edc:mask="0x1" edc:name="WDTPSTA" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1" edc:name="WDTPS" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
